{
    "Teaching Assistant": {
        "dateStart": "January 2023",
        "dateEnd": "August 2023",
        "location": "Seattle",
        "displayImage": "./img/uwiSchool.png",
        "company": "University of Washington iSchool",
        "text": ["During my time as a student, I instructed three different courses over the course of three quarters. These courses can be found as followed:",
            "</b>Cooperative Software Development</p> - Summer 2023",
            ["</u>Instructed</p> cooperative user-centered software development practices, emphasizing </u>agile methodologies </p>and </u>GitHub usage",
                "</u>Taught </p>weekly lab sessions with 35 students on </u>JavaScript/React,</p> </u>Unit Testing,</p> and </u>collaborative work practices</p> derived from course materials",
                "Supported the professor by developing lectures, facilitating weekly stakeholder meetings, and encouraging student engagement in group activities"],
            "</b>Exploring Informatics</p> - Spring 2023",
                ["</u>Led</p> two weekly lab sessions with 30 students on </u>Data Collection</p>, </u>Data Bias</p>, Privacy, Design, and </u>AI</p>",
                "Collaborated with the professor to teach non-informatics majors about Informatics from ethical and legal standpoints",
                "Managed administrative responsibilities, including organizing lecture notes and assisting in course structure"],
            "</b>Open Science Data</p> - Winter 2023",
                ["Collaborated with the professor to deliver lectures and lead discussions on </u>data-driven science</p> and </u>technology</p> topics while developing course materials and aligning content with learning resources",
                "Hosted consistent office hours to assist students with coursework inquiries",
                "Managed administrative responsibilities, including communicating with the professor regarding student performance and attendance records"]
        ]
    },
    "Coding Instructor": {
        "dateStart": "January 2024",
        "dateEnd": "Present",
        "location": "Seattle",
        "displayImage": "./img/CWK.png",
        "company": "Coding With Kids",
        "text": ["Currently working as an instructor teaching coding concepts to students. This entails:",
            ["Facilitate collaborative learning environments to introduce students of diverse backgrounds to fundamental coding principles.",
                "Lead weekly coding sessions for a cohort of 15 students, emphasizing strong coding fundamentals and problem-solving skills",
                "Collaborate closely with other instructors to develop and implement effective lesson plans tailored to meet the needs of individual students to ensure consistent learning outcomes."]
        ]
    }
}